ott-libs-backend/app/controllers/api/v1/recaps_controller.rb

  def index
    @recaps = Recap.all
---
SELECT "user_recaps".* FROM "user_recaps" WHERE "user_recaps"."recap_id" = $1  [["recap_id", 1]]

  def show
    @recap = Recap.find(params[:id])
---
SELECT  "recaps".* FROM "recaps" WHERE "recaps"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]