ott-libs-backend/app/controllers/api/v1/stories_controller.rb

INSERT INTO "recaps" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2019-05-27 21:38:56.716016"], ["updated_at", "2019-05-27 21:38:56.716016"]]
INSERT INTO "stories" ("full_story", "recap", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["full_story", "blah blah whatever test this is after input"], ["recap", 3], ["user_id", 2], ["created_at", "2019-05-28 15:45:18.732050"], ["updated_at", "2019-05-28 15:45:18.732050"]]
---
  def create
    Story.create(full_story: params[:full_story], user_id: params[:user_id], recap: params[:recap])

SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @story = Story.find(params[:id])