ott-libs-backend/app/controllers/api/v1/stories_controller.rb

SELECT "stories".* FROM "stories"
---
  def index
    @stories = Story.all