ott-libs-backend/app/controllers/api/v1/templates_controller.rb

SELECT "templates".* FROM "templates"
---
  def index
    @templates = Template.all