ott-libs-backend/app/controllers/api/v1/users_controller.rb

  def create
    @user = User.find_or_create_by(name: params[:name])
---
INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Ferris"], ["created_at", "2019-05-27 21:02:32.020869"], ["updated_at", "2019-05-27 21:02:32.020869"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Ferris"], ["LIMIT", 1]]

  def show
    @user = User.find(params[:name])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]